/*
 * @Description: Description
 * @Author: Kerwin
 * @Date: 2023-02-14 00:40:50
 * @LastEditTime: 2023-02-14 17:20:03
 * @LastEditors:  Please set LastEditors
 */

const idioms = [
  { name: "芝兰玉树", desc: "比喻德才兼备有出息的子弟" },

  { name: "暮云春树", desc: "比喻思念远方的知己" },

  {
    name: "白首如新",
    desc: "倾盖如故：有些人虽然相交已久，却如同初识一般。有些人刚刚认识，却好像认识了很久一样，一见如故。比喻感情的厚薄是不以时间长短来衡量的",
  },

  {
    name: "目成心许",
    desc: "形容男女双方眉目传情，互通爱慕之意，心里暗暗相许",
  },

  { name: "林下风气", desc: "指女子态度娴雅、举止大方" },

  { name: "旁求俊彦", desc: "向各方面征求贤才" },

  { name: "沅芷澧兰", desc: "很喜欢这个成语。比喻高洁的人或事物" },

  { name: "瘗玉埋香", desc: "指美丽的女子死亡" },

  { name: "小春日和", desc: "短暂的回温，之后陷入漫漫的寒冷" },

  { name: "软红香土", desc: "形容都市的繁华" },

  { name: "温澜潮生", desc: "内心涌起一阵阵暖意，温柔的情怀" },

  { name: "兰因絮果", desc: "兰花一样美好的遇见，最后还是一别两宽柳絮纷飞" },

  { name: "阳和启蛰", desc: "比喻恶劣的环境过去，顺利和美好的时光开始了" },
  {
    name: "一期一会",
    desc: "人的一生中可能只能够和对方见面一次，因而要以最好的方式对待对方",
  },

  { name: "流绪微梦", desc: " 一种轻忽飘渺的情感，就好像流动的思绪，细微的梦" },

  { name: "天雨流芳", desc: "纳西语音译语，意为“读书去吧" },

  {
    name: "花晨月夕",
    desc: "有鲜花的早晨，有明月的夜晚。指能够拥有美好的时光和景物",
  },

  {
    name: "光风霁月",
    desc: "比喻开阔的胸襟和心地，也比喻太平清明的政治局面。明·苏濬《鸡鸣偶记》：“风光月霁，是吾心太虚真境；鸟语花阴，是吾心无尽生意",
  },

  { name: "雪泥鸿爪", desc: "比喻往事遗留的痕迹" },

  { name: "甘棠遗爱", desc: "旧时颂扬离去的地方官" },

  { name: "洪炉点雪", desc: "形容对问题领悟极快" },

  {
    name: "桃李不言",
    desc: "下自成蹊：比喻为人品德高尚、诚实、正直，用不着自我宣传，就自然受到人们的尊重和敬仰",
  },

  { name: "含英咀华", desc: "比喻读书时细细琢磨领会文章的精华" },

  { name: "琴瑟之好", desc: "比喻夫妻间感情和谐" },

  { name: "冬日夏云", desc: "冬天的太阳，夏天的云。美好的事物" },

  { name: "繁星如沸", desc: "星星多而热闹" },

  {
    name: "白河夜船",
    desc: "睡得香甜，酣睡不知身边的事。也指懵懂，什么都不知道的样子",
  },

  { name: "耕云种月", desc: " 指一种闲适的生活境界" },

  { name: "海晏河清", desc: " 比喻沧海波平，黄河水清，天下太平" },

  { name: "无远弗届", desc: " 不管多远，没有到不了的地方" },
  { name: "驿寄梅花", desc: "比喻向远方友人表达思念之情" },

  { name: "秋水伊人", desc: "指思念中的那个人" },

  { name: "岸芷汀兰", desc: "形容人像芳兰一样品德高尚，谦让有礼" },

  { name: "含宫咀徵", desc: "指沉浸于优美的乐曲之中" },

  {
    name: "白驹空谷",
    desc: "比喻贤能之人在野而不能出仕。后也比喻贤能者出仕而谷空",
  },

  {
    name: "共挽鹿车",
    desc: "旧时称赞夫妻同心，安贫乐道。出自《后汉书·鲍宣妻传》",
  },

  { name: "并蒂芙蓉", desc: "比喻恩爱夫妻或情侣" },

  { name: "清如冰壶", desc: "比喻为人高洁，不同凡俗。也比喻诗文格调清新" },

  { name: "月白风清", desc: "形容幽静美好的夜晚。出自宋•苏轼《后赤壁赋》" },

  {
    name: "阳春白雪",
    desc: "原指战国时代楚国的较高雅的歌曲，后比喻高深的不通俗的文学艺术",
  },

  {
    name: "流风回雪",
    desc: "寓意在风的吹拂中飘着雪花，形容女子婀娜多姿。也比喻文笔飘逸曲折，出自三国时期曹植的《洛神赋》",
  },

  { name: "仙姿玉貌", desc: "形容女子姿态容貌都美，一眼就惊艳到" },

  { name: "蕙心纨质", desc: "心灵如蕙草芬芳，品质似纨素洁白。比喻品行高洁" },

  {
    name: "停云落月",
    desc: "表示对亲友的怀念（旧时多用在书信里）出自晋·陶潜《停云诗序》：“停云，思亲友也。”唐·杜甫《梦李白》诗：“落月满屋梁，犹疑照颜色",
  },

  { name: "超逸绝尘", desc: "指不拘滞于世俗，超然物外" },

  { name: "琼枝玉树", desc: "指披上冰雪的树木。也比喻品格高洁的人" },

  {
    name: "白衣公卿",
    desc: "古时指进士。唐代人极看重进士，宰相多由进士出身，故推重进士为白衣卿相，是说虽是白衣之士，但享有卿相的资望",
  },

  {
    name: "烟岚云岫",
    desc: "形容山峦之间云雾之气弥漫缭绕。出自宋·陆游《万卷楼记》：“ 烟岚云岫，洲渚林薄，更相映发，朝莫万态",
  },

  {
    name: "采兰赠芍",
    desc: "比喻男女互赠礼物，表示相爱。出自《诗经·郑风·溱洧》",
  },

  {
    name: "绿鬓朱颜",
    desc: "形容年轻美好的容颜，借指年轻女子。出自宋·晏殊《少年游》词：“绿鬓朱颜，道家装束，长似少年时",
  },

  {
    name: "靡颜腻理",
    desc: "形容容貌美丽，皮肤细腻柔滑。出自战国·楚·宋玉《招魂》：“靡颜腻理，遗视绵些",
  },

  { name: "水木清华", desc: "意思是指园林景色清朗秀丽" },

  { name: "杏雨梨云", desc: "杏花如雨，梨花似云。形容春天景色美丽" },

  { name: "云蒸霞蔚", desc: "像云雾彩霞升腾聚集起来一样。形容繁盛艳丽" },

  { name: "晓风残月", desc: "形容冷落凄凉的意境。出自北宋·柳永的《雨霖铃》" },

  { name: "司马青衫", desc: "意思是指极度悲伤。出自《琵琶行》" },

  { name: "吉祥止止", desc: "接连而来，好事不断出现" },

  {
    name: "水银泻地",
    desc: "水银倒在地上，很快就会全部渗入土中。比喻无微不至，极为细密周到",
  },

  { name: "波谲云诡", desc: "好像云彩和水波那样，形态不可捉摸" },

  {
    name: "谈霏玉屑",
    desc: "谈话时美好的言辞像玉的碎末纷纷洒落一样。形容言谈美妙，滔滔不绝",
  },

  { name: "双瞳剪水", desc: "形容眼睛清澈明亮" },

  {
    name: "傅粉何郎",
    desc: "原指何晏面白，如同搽了粉一般；后泛指美男子。出自《世说新语·容止》",
  },

  {
    name: "绿肥红瘦",
    desc: "形容绿叶茂盛，花渐凋谢，指暮春时节，也形容春残的景象。出自《如梦令》",
  },

  {
    name: "舞衫歌扇",
    desc: "意思是歌舞的装束、用具，即指歌舞。也指能歌善舞的人。出自《杂曲》",
  },

  { name: "金石丝竹", desc: "泛指各种乐器，也形容各种声音。出自《庄子·骈母》" },

  { name: "红叶题诗", desc: "唐代宫女良缘巧合的故事。比喻姻缘的巧合" },

  {
    name: "梅妻鹤子",
    desc: "意思是以梅为妻，以鹤为子，比喻隐逸生活和恬然自适的清高情态。也是中国传统绘画的常见题材之一。出自宋·沈括《梦溪笔谈卷十·人事二》",
  },

  { name: "衣香鬓影", desc: "形容妇女的衣着穿戴十分华丽（多指人多的场合）" },

  {
    name: "摽梅之年",
    desc: "比喻女子已到了出嫁的年龄。出自《诗经·召南·摽有梅》",
  },

  {
    name: "张敞画眉",
    desc: "指张敞替妻子画眉毛，旧时比喻夫妻感情好。出自《汉书·张敞传》",
  },

  {
    name: "浑俗和光",
    desc: "比喻不露锋芒，与世无争。出自《西厢记》第一本第二折",
  },

  { name: "如约而至", desc: "按着约定准时到达" },

  { name: "对床夜雨", desc: "亲友或兄弟久别重逢。出自《雨中招张司业宿》" },

  {
    name: "浮生若梦",
    desc: "意思是把人生当作短暂虚幻的梦境，出自《庄子·刻意》",
  },

  {
    name: "静水流深",
    desc: "通过表面平静的水并不知道水底下有多深，来暗喻表面不声不响的人却蕴藏着大的智慧",
  },

  {
    name: "吉光片羽",
    desc: "比喻残存的珍贵文物。出自《西京杂记》（有首歌的名字是这个感觉也蛮好听的）",
  },

  { name: "雍雍穆穆", desc: "和谐融洽貌；穆穆：形容举止端庄" },

  { name: "神清气朗", desc: "形容人心神清爽；形容人长得神态清明，气质爽朗" },

  {
    name: "步步莲花",
    desc: "出自语本《杂宝藏经·莲花夫人缘》故事，谓莲花夫人“脚蹈地处皆莲华出”，原形容女子步态轻盈。亦可比喻渐入佳境",
  },

  {
    name: "傍花随柳",
    desc: "出自宋代程灏的《春日偶成》：“云淡风轻近午天，傍花随柳过前川。”形容春游的快乐",
  },

  {
    name: "春花秋月",
    desc: "春天的花，秋天的月。指春秋佳景或泛指美好的时光。也指岁月更迭",
  },

  {
    name: "花光柳影",
    desc: "出处清朝时期曹雪芹的《红楼梦》第二十五回：“花光柳影，鸟语溪声。”指百花流彩生光，垂柳投影摇曳。形容春到人间，多彩清新",
  },

  { name: "歌尽倾君", desc: "一首歌演唱完毕，青春岁月全部托付给了所爱之人" },

  {
    name: "伊人夕岸",
    desc: "感叹时光流逝，伊人，美人夕岸，近晚。美人迟暮。又或者心里的人儿远离自己",
  },

  {
    name: "月落乌啼",
    desc: "形容天色将明未明时的景象。出自《枫桥夜泊》，《桃符记·第三折》",
  },

  { name: "郢中白雪", desc: "指高雅的乐曲或诗文。出自《答楚王问》" },

  {
    name: "玉汝于成",
    desc: "意思是爱你如玉，帮助你，使你成功。多用于艰难困苦条件下。出自《诗经·大雅·民劳》",
  },

  {
    name: "云树之思",
    desc: "比喻朋友阔别后的相思之情。出自唐·杜甫《春日忆李白》(和前文暮云春树有异曲同工之妙)",
  },

  { name: "琨玉秋霜", desc: "比喻坚贞劲烈的品质。出自《后汉书·孔融传论》" },

  { name: "绮纨之岁", desc: "指少年时代" },

  {
    name: "掷果潘安",
    desc: "旧时比喻为女子所爱慕的美男子，出自《世说新语笺疏》下卷上《容止》",
  },
  {
    name: "乂氼嫑忈",
    py: "ài nǐ biáo rén",
    desc: "爱你一人，从无二心;执子之手，与子偕老",
  },
];

export const pickRandom = () => {
  const len = idioms.length;
  const i = Math.floor(len * Math.random());
  return idioms[i];
};
